{
  "backend/main.mo": "Main backend actor implementing contact message management, user authentication with role-based access control, user profiles, Stripe product management, and blob storage integration for file uploads.",
  "feature_evidence.json": "Feature evidence report documenting the footer copyright text update to display '© 2025. With ❤ by FoxP2' in three languages (Polish, English, German) with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including the LanguageContext with new 'copyrightText' translation key and Footer component updated to use this key for displaying copyright text with heart emoji.",
  "frontend/index.html": "HTML entry point with comprehensive favicon/PWA support including meta tags, manifest references, and multiple icon sizes for cross-device compatibility.",
  "frontend/src/App.tsx": "Root application component wrapping the app with ThemeProvider and LanguageProvider, rendering Header, HomePage, Footer, ScrollToTopButton, and Toaster components.",
  "frontend/src/components/AdminMessagesDialog.tsx": "Admin dialog for viewing, selecting, deleting, and exporting contact messages to PDF with checkbox selection and internationalized UI.",
  "frontend/src/components/AdminNotifications.tsx": "Empty component file with no implementation.",
  "frontend/src/components/ContactForm.tsx": "Dialog-based contact form with validation, character limit (250), and internationalized labels/messages for submitting contact inquiries.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company logo, contact information, services, and copyright text using the 'copyrightText' translation key with principal ID display for logged-in users and RODO modal trigger.",
  "frontend/src/components/Header.tsx": "Header component with navigation, theme toggle, language selector, and Internet Identity authentication. Includes admin message dialog access for authorized users and smooth scrolling to page sections.",
  "frontend/src/components/RodoModal.tsx": "Modal dialog displaying GDPR/RODO privacy policy information including data processing purpose, scope, storage, access rights, and contact details. Uses scrollable content area with localized text.",
  "frontend/src/components/ScrollToTopButton.tsx": "Floating button that appears after scrolling 300px down the page and smoothly scrolls back to top when clicked. Includes fade-in/out animation.",
  "frontend/src/components/Web3CardManager.tsx": "Admin interface for managing Web3 project cards with CRUD operations, image upload to blob storage, and auto-generated translation previews. Includes form validation and translation quality indicators.",
  "frontend/src/contexts/LanguageContext.tsx": "React context providing multi-language support (Polish, English, German) with translation function and language switching. Contains comprehensive translation dictionaries for all UI text.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status. Provides AuthClient wrapper with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for contact messages (submit, get, delete), admin checks, and Web3 card CRUD operations (get, add, update, delete), all using the actor from useActor hook.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including OKLCH color definitions for primary, secondary, sidebar, web2/web3 colors, and utility classes for text shadows and animations.",
  "frontend/src/lib/translationService.ts": "Translation service providing Polish-to-English and Polish-to-German mappings for Web3, DeFi, blockchain, and technology-related terms with context-aware translations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, InternetIdentity provider, and renders the App component into the root DOM element.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component featuring an animated slogan, Web3 cards display, contact form, and admin management dialog with multi-language support and authentication checks.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH colors, container settings, border radius variables, and accordion animations using typography and animate plugins.",
  "project_state.json": "Project state metadata tracking feature requests to update footer copyright text to '© 2025. With ❤ by FoxP2' with translations in Polish, English, and German."
}